frontend/controllers/TripApiController.php

SELECT * FROM `triplogin` WHERE `authkey`='IKIE3kFV-pEb6npJ2T-ftSw6O0dsQ1sw'
---
function authorization(){
	$params = (Yii::$app->request->headers);
	$authorization=$params['authorization'];
	$authorization=str_replace('Bearer', '', $authorization);
	$authorization=trim($authorization);
	$user_data_role = Triplogin::find()
					->where(['authkey'=>$authorization])
					->one();

SELECT COUNT(*) FROM `stk_count_login_log` WHERE (`login_username`='TN18AQ3614') AND (`allow_status`='blocked')
---
  function sessioncheck($username){


  $authorization=trim($username);
  $login_log=StkCountLoginLog::find()->where(['login_username'=>$authorization])->andWhere(['allow_status'=>'blocked'])->count();

INSERT INTO `allen_api_log` (`event`, `data`) VALUES ('trip-list', '{\"login_key\":\"T\",\"login_name\":\"TN18AQ3614\"}')
---
public function actionTripList()
{
   $list = array();
  $postd=(Yii::$app ->request ->rawBody);
  $requestInput = json_decode($postd,true);

  $log_model=new AllenApiLog();
  $log_model->event='trip-list';
  $log_model->data=$postd;
  $log_id='';
  if($log_model->save()){

SELECT * FROM `customer_details`
---
      if($login_key!="" && $login_key=="T")
      {
    if($usercheck = $this->sessioncheck($username)){
      $customer_data = CustomerDetails::find()->asArray()->all();

SELECT * FROM `vehicle_master`
SELECT * FROM `driver_profile`
SELECT * FROM `triplogin` WHERE `username`='TN18AQ3614'
---
      $cust_Address_Arr = ArrayHelper::map($customer_data,'id','company_address');
      $cust_PersAdd_Arr = ArrayHelper::map($customer_data,'id','personal_address');

      $vehicle_data = VehicleMaster::find()->asArray()->all();
      $vehi_name_Arr = ArrayHelper::map($vehicle_data,'id','vehicle_name');
      $vehi_no_Arr = ArrayHelper::map($vehicle_data,'id','reg_no');

      $driver_data = DriverProfile::find()->asArray()->all();
      $driver_name_Arr = ArrayHelper::map($driver_data,'id','driver_name');
      $mobile_no_Arr = ArrayHelper::map($driver_data,'id','mobile_number');

          $user_data_role = Triplogin::find()
          ->where(['username'=>$username])->asArray()
          ->one();

SELECT * FROM `trip_details` WHERE (`status`='A') AND (`vehicle_number`='TN18AQ3614') AND (`trip_current_status`='S')
---
            $driver_name = $user_data_role['first_name'].'  '.$user_data_role['last_name'];
          }

          $trip = TripDetails::find()->where(['status'=>"A"])
          ->andWhere(['vehicle_number'=>$username])
          ->andWhere(['trip_current_status'=>'S'])
          ->asArray()->one();

SELECT * FROM `trip_details` WHERE (`status`='A') AND (`vehicle_number`='TN18AQ3614') ORDER BY `trip_date_time`
---



        $trip_data = TripDetails::find()
          ->where(['status'=>'A'])
          ->andWhere(['vehicle_number'=>$username])
          ->asArray()
          ->orderBy(['trip_date_time'=>SORT_ASC])
          ->all();